# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialType..::..Name Property
WireMaterialType Class See Also
---
Get name of wire material type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string Name { set; }
```

Visual Basic
---
```text
Public Overrides WriteOnly Property Name As String
	Set
```

Visual C++
---
```text
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Set name can't be supported. |

# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace